Yu-Ting-Sun/yiki-m55m1/main.cpp
        uint32_t nz = output_nonzero_count(model);
        if (nz < min_nz) min_nz = nz;

        sum_us   += dt;
        sumsq_us += (uint64_t)dt * dt;
        if (dt > max_us) max_us = dt;
        if (dt < min_us) min_us = dt;
    }

    uint32_t avg_us = (uint32_t)(sum_us / INFER_ITERS);
    uint64_t var    = (sumsq_us / INFER_ITERS) - (uint64_t)avg_us * avg_us;
    uint32_t std_us = isqrt_u64(var);

    printf("  latency: avg=%u.%03u ms  max=%u.%03u ms  min=%u.%03u ms  std=%u us\n",
           avg_us / 1000, avg_us % 1000,
           max_us / 1000, max_us % 1000,
           min_us / 1000, min_us % 1000,
           std_us);
    printf("  output sanity: min non-zero bytes across runs = %u  -> %s\n",
           (unsigned)min_nz, (min_nz > 0) ? "OK (NPU produced data)"
                                          : "FAIL (all-zero output!)");

    /* BOTH criteria gate the verdict. (An earlier version returned only the
     * sanity check, so the final summary claimed PASS while the latency line
     * said FAIL — gesture @177 ms slipped through as a false PASS.) */
    bool latency_ok = (avg_us < 100000u);
    printf("  <100 ms target: %s\n", latency_ok ? "PASS" : "FAIL");

    return (min_nz > 0) && latency_ok;
}

/*----------------------------------------------------------------------------
 * Test 4 — alternating inference across two RESIDENT interpreters.
 * No re-Init per switch: MicroMutableOpResolver ops register once, so each
 * model was Init'd once (own arena slice) and switching = invoking the other
 * object. Switch overhead is therefore ~0; what we verify here is that 500
 * alternations run without crash, without cross-model state corruption, and
 * with sane (non-zero) NPU output every time.
 *--------------------------------------------------------------------------*/
static bool test_alternating(void)
{
    printf("\n=== Test 4: Alternating Inference (%d switches, resident interpreters) ===\n",
           ALT_SWITCHES);

    if (!s_initOk[MODEL_FACE] || !s_initOk[MODEL_GESTURE])
    {
        printf_err("  skipped: both interpreters must be initialised first\n");
        return false;
    }

    uint64_t inf_sum_us[MODEL_COUNT] = { 0, 0 };
    uint32_t inf_max_us[MODEL_COUNT] = { 0, 0 };
    uint32_t cnt[MODEL_COUNT]        = { 0, 0 };
    uint32_t min_nz_all              = 0xFFFFFFFFu;

    for (int i = 0; i < ALT_SWITCHES; i++)
    {
        int idx = i & 1;   /* alternate face / gesture */
        arm::app::Model &model = (idx == MODEL_FACE)
                                 ? static_cast<arm::app::Model &>(faceModel)
                                 : static_cast<arm::app::Model &>(gestureModel);

        fill_input(model, (uint32_t)i + 1u);

        uint32_t t0 = GetSystemTick_us();
        bool ran   = model.RunInference();
        uint32_t inf_us = GetSystemTick_us() - t0;

        if (!ran)
        {
            printf_err("  switch %d: RunInference() failed\n", i);
            printf("Test 4 result: FAIL at switch %d/%d\n", i, ALT_SWITCHES);
            return false;
        }

        uint32_t nz = output_nonzero_count(model);
        if (nz < min_nz_all) min_nz_all = nz;

        inf_sum_us[idx] += inf_us;
        if (inf_us > inf_max_us[idx]) inf_max_us[idx] = inf_us;
        cnt[idx]++;

        if (((i + 1) % 100) == 0)
            printf("  ...%d/%d switches ok\n", i + 1, ALT_SWITCHES);
    }

    for (int k = 0; k < MODEL_COUNT; k++)
    {
        if (cnt[k] == 0) continue;
        uint32_t inf_avg = (uint32_t)(inf_sum_us[k] / cnt[k]);
        printf("  %-8s: inference avg=%u.%03u ms  max=%u.%03u ms  (%u runs)\n",
               (k == MODEL_FACE) ? "FACE" : "GESTURE",
               inf_avg / 1000, inf_avg % 1000,
               inf_max_us[k] / 1000, inf_max_us[k] % 1000,
               (unsigned)cnt[k]);
    }
    printf("  switch overhead: ~0 (interpreters resident; no re-Init/re-alloc)\n");
    printf("  output sanity over all switches: min non-zero = %u -> %s\n",
           (unsigned)min_nz_all, (min_nz_all > 0) ? "OK" : "FAIL (all-zero!)");
    printf("Test 4 result: %s (%d/%d switches, no crash)\n",
           (min_nz_all > 0) ? "PASS" : "PARTIAL", ALT_SWITCHES, ALT_SWITCHES);

    return (min_nz_all > 0);
}

#endif /* RUN_DAY1_TESTS */

#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
/*----------------------------------------------------------------------------
 * Phase-5: debounced recognition -> slideshow album filter. Called once per
 * captured camera frame with the recognised label, or NULL when nobody was
 * recognised this frame (no face, unknown face, or recog unavailable).
 *--------------------------------------------------------------------------*/
static void SlideFilter_Update(const char *label)
{
    static char     curUser[32]  = "";   /* active filter, "" = play all  */
    static char     candUser[32] = "";
    static int      candHits     = 0;
    static uint32_t lastSeenMs   = 0;

    if (label != NULL)
    {
        lastSeenMs = GetSystemTick_ms();

        if (strncmp(label, candUser, sizeof(candUser)) != 0)
        {
            strncpy(candUser, label, sizeof(candUser) - 1);
            candUser[sizeof(candUser) - 1] = '\0';
            candHits = 1;
        }
        else if (candHits < FILTER_SWITCH_HITS)
            candHits++;

        if (candHits >= FILTER_SWITCH_HITS &&
            strncmp(candUser, curUser, sizeof(curUser)) != 0)
        {
            strcpy(curUser, candUser);
            int n = Slideshow_SetFilter(curUser);
            printf("[FILTER] -> '%s' (%d album(s))\n", curUser, n);
        }
    }
    else if (curUser[0] != '\0' &&
             (GetSystemTick_ms() - lastSeenMs) > FILTER_CLEAR_MS)
    {
        curUser[0]  = '\0';
        candUser[0] = '\0';
        candHits    = 0;
        Slideshow_SetFilter(NULL);
        printf("[FILTER] -> all (nobody recognised for %u ms)\n",
               (unsigned)FILTER_CLEAR_MS);
    }
}
#endif /* RUN_FACE_RECOG && !RUN_FACE_ENROLL */

/*----------------------------------------------------------------------------
 * main
 *--------------------------------------------------------------------------*/
int main(void)
{
    BoardInit();          /* clocks, UART, HyperRAM map, SD mount, NPU init */

#if RUN_ESP_PROBE
    /* Must run before PerfTimer_Init(): the probe owns SysTick for delays. */
    esp_probe_run();      /* never returns */
#endif

