Yu-Ting-Sun/yiki-m55m1/main.cpp
    /* NOTE: no DWT register is read here anymore - touching DWT/CoreSight
     * without a live debug session hangs this board (standalone-reset bug). */
    if (PerfTimer_Init())             /* timing source: DWT, else SysTick */
        printf("[OK] timing source: DWT CYCCNT (cycle-accurate)\n");
    else
        printf("[OK] timing source: SysTick 64-bit (DWT disabled - see PerfTimer.h)\n");

#if RUN_DAY2_TESTS
    day2_test_run();      /* Wi-Fi + HTTP link validation; never returns */
#endif

#if RUN_DAY3_DEMO
    /* Day-3 demo: story rail + photo slideshow side by side. */
    if (Display_Init() == 0)
    {
        int d3 = day3_demo_run();
        if (d3 != 0)
            printf_err("Day-3 story failed (rc=%d) - running photos only\n", d3);

        Slideshow_ReserveRight(STORYUI_RESERVED_PX);
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);

        int slrc;

        if (Slideshow_LibScan(SLIDESHOW_DIR) < 0)
            slrc = -1;
        else
        {
#if RUN_CAMERA_PREVIEW
            /* Preview sits in the bottom-right corner of the photo region.
             * No camera (init fail) degrades to the plain slideshow. */
            bool     camOk = (Camera_Init() == 0);
            uint32_t camX  = Disaplay_GetLCDWidth() - STORYUI_RESERVED_PX - CAM_W;
            uint32_t camY  = Disaplay_GetLCDHeight() - CAM_H;
#if RUN_FACE_DETECT
            /* Face detection draws boxes onto the frame before it is blitted.
             * Init failure degrades to plain preview (no boxes). */
            bool fdOk = camOk && (FaceDetect_Init() == 0);
#if RUN_FACE_RECOG
            bool frOk = fdOk && (FaceRecog_Init() == 0);
#endif
#if RUN_FACE_ENROLL
            int  enrollSeen = 0;
#endif
            /* Single combined arena MPU setup (cacheable WTRA): the BSP
             * configures all app MPU regions in ONE InitPreDefMPURegion call,
             * so both arenas are set together here rather than per module. */
            if (fdOk)
            {
                ARM_MPU_Region_t rg[2];
                uint32_t nrg = 0;
                void    *aBase; uint32_t aSize;

                FaceDetect_GetArena(&aBase, &aSize);
                rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                nrg++;
#if RUN_FACE_RECOG
                if (frOk)
                {
                    FaceRecog_GetArena(&aBase, &aSize);
                    rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                    rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                    nrg++;
                }
#endif
                InitPreDefMPURegion(&rg[0], nrg);
            }
#endif
#endif

            for (;;)
            {
                slrc = Slideshow_ShowNext();
                if (slrc != 0) break;

                /* Hold window: this idle time is where the camera (and later
                 * the face-recognition inference) runs. */
                uint32_t t0 = GetSystemTick_ms();

                while ((GetSystemTick_ms() - t0) < SLIDESHOW_HOLD_MS)
                {
#if RUN_CAMERA_PREVIEW
                    if (camOk)
                    {
                        if (Camera_Capture() != 0)
                        {
                            camOk = false;      /* capture died: stop trying */
                            continue;
                        }

                        uint16_t *frame = (uint16_t *)Camera_GetFrame();

#if RUN_FACE_DETECT
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
                        const char *seenUser = NULL;
#endif
                        if (fdOk && FaceDetect_Run(frame, CAM_W, CAM_H) > 0)
                        {
                            FaceBox tb;
                            if (FaceDetect_GetTopBox(&tb))
                            {
#if RUN_FACE_RECOG
#if RUN_FACE_ENROLL
                                if (frOk && enrollSeen < ENROLL_SAMPLES)
                                {
                                    FaceRecog_Enroll(frame, CAM_W, CAM_H, &tb, ENROLL_LABEL);
                                    if (++enrollSeen >= ENROLL_SAMPLES)
                                        printf("[ENROLL] captured %d samples — done\n", ENROLL_SAMPLES);
                                }
#else
                                if (frOk && FaceRecog_Run(frame, CAM_W, CAM_H, &tb) == 1)
                                    seenUser = FaceRecog_GetLabel();
#endif
#endif
                            }
                        }
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
                        SlideFilter_Update(seenUser);
#endif
#endif
                        Camera_Blit(camX, camY);
                        continue;
                    }
#endif
                    Display_Delay(50);
                }
            }
        }

        printf_err("Slideshow could not run (rc=%d) - keeping story screen\n", slrc);
        for (;;) __WFI();     /* keep whatever is on screen; demo is over */
    }
    printf_err("Display_Init failed (check LCD panel define in board_config.h)\n");
#endif

#if RUN_SLIDESHOW && !RUN_DAY3_DEMO
    /* Photo-frame milestone: cycle SD-card photos on the LCD. Never returns
     * while it has photos to show; on failure fall through to the tests. */
    if (Display_Init() == 0)
    {
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);
        int slrc = Slideshow_Run(SLIDESHOW_DIR, SLIDESHOW_HOLD_MS);
        printf_err("Slideshow could not run (rc=%d) - continuing with tests\n", slrc);
    }
    else
    {
        printf_err("Display_Init failed (check LCD panel define in board_config.h) - continuing with tests\n");
    }
#endif

#if RUN_DAY1_TESTS
    printf("\n");
    printf("==============================================\n");
    printf(" M55M1 Dual-Model PoC - Day 1 Validation\n");
    printf("==============================================\n");
    printf(" HyperRAM   : FACE @0x%08X  GESTURE @0x%08X  slot=%u KB\n",
           (unsigned)FACE_MODEL_ADDR, (unsigned)GESTURE_MODEL_ADDR,
           (unsigned)(MODEL_SLOT_SIZE / 1024));
    printf(" arenas     : FACE %u KB @0x%08X | GESTURE %u KB @0x%08X (resident)\n",
           (unsigned)(FACE_ARENA_SZ / 1024),    (unsigned)(uintptr_t)FACE_ARENA_PTR,
           (unsigned)(GESTURE_ARENA_SZ / 1024), (unsigned)(uintptr_t)GESTURE_ARENA_PTR);

